Revit 2027 API
CriticalPathCollector.GetCalculatedFlow Method
 Gets the calculated flow of the network.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetCalculatedFlow()
Public Function GetCalculatedFlow As Double
public:
double GetCalculatedFlow()
member GetCalculatedFlow : unit -> float
Return Value
Double
 The flow value in the internal Revit unit ft^3/second.
Remarks
 The calculated flow is the maximum flow value of any analytical segment on the network, typically associated with the main branch.
See Also
Reference
CriticalPathCollector Class
Autodesk.Revit.DB.Analysis Namespace